#Пользователь вводит время в секундах.
# Переведите время в часы, минуты и секунды
# и выведите в формате чч:мм:сс. Используйте форматирование строк.

hours = int(input('Пожалуйста, введите количество часов в секундах: '))
minutes = int(input('Пожалуйста, введите количество минут в секундах: '))
seconds = int(input('Пожалуйста, введите количество секунд: '))

hours = hours // 60
minutes = minutes // 60

print(f'Точное время: {hours}:{minutes}:{seconds}')


