#Запросите у пользователя значения выручки и издержек фирмы.
# Определите, с каким финансовым результатом работает фирма


revenue = int(input('Введите сумму выручки компании: '))
costs = int(input('Введите сумму издержек компании: '))
profit = revenue - costs

if revenue > costs:
    print(f'Поздравляю! Прибыль компании = {profit}. Ваша компания рентабельна.')

else:
    print('К сожалению, ваша компания работает в убыток.')
    exit()

staff = int(input('Введите количество сотрудников компании: '))

person_profit = profit // staff

print(f'Прибыль фирмы в расчете на одного сотрудника: {person_profit}')
