# Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и через dict.

user_answer = int(input('Введите номер месяца: '))

seasons = ['Зима', 'Весна', 'Лето', 'Осень']

months = {
    1 : 'Январь',
    2 : 'Февраль',
    3 : 'Март',
    4 : 'Апрель',
    5: 'Май',
    6: 'Июнь',
    7: 'Июль',
    8: 'Август',
    9: 'Сентябрь',
    10: 'Октябрь',
    11: 'Ноябрь',
    12: 'Декабрь',
}

el = months[user_answer]


if user_answer >= 2 and user_answer <= 5:
    print(f'Вы назвали {el} - это {seasons[1]}.')
elif user_answer >= 6 and user_answer <= 8:
    print(f'Вы назвали {el} - это {seasons[2]}.')
elif user_answer >= 9 and user_answer <= 11:
    print(f'Вы назвали {el} - это {seasons[3]}.')
else:
    print(f'Вы назвали {el} - это {seasons[0]}.')

