# 1. Реализовать класс Matrix (матрица). Обеспечить перегрузку конструктора класса (метод __init__()),
# который должен принимать данные (список списков) для формирования матрицы.
# Подсказка: матрица — система некоторых математических величин, расположенных в виде прямоугольной схемы.
# Примеры матриц вы найдете в методичке.
# Следующий шаг — реализовать перегрузку метода __str__() для вывода матрицы в привычном виде.
# Далее реализовать перегрузку метода __add__() для реализации операции сложения двух объектов класса Matrix (двух матриц).
# Результатом сложения должна быть новая матрица.


import numpy as np

class Matrix:
    def __init__(self, arr: list):
        self.arr = arr

    def __str__(self):
        return f'{self.arr}'


    def __add__(self, other):
        new_arr = np.array([self.arr[i] + other.arr[i] for i in range(len(self.arr))])
        new_matrix = Matrix(new_arr.reshape(2,4))
        return new_matrix


v_1 = Matrix([4, 11, 18, 2, 21, 7, 23, 9])
v_2 = Matrix([36, 15, 32, 5, 6, 4, 14, 31])

v_3 = v_1 + v_2
print(v_3)






import numpy as np
arr = np.array([1,2,3,4,5,6,7,8,9])
arr.reshape(3,3)