# Создать (программно) текстовый файл, записать в него программно набор чисел, разделенных пробелами.
# Программа должна подсчитывать сумму чисел в файле и выводить ее на экран.

with open ("number_set.txt", "w+") as f_obj:
        line = input('Введите числа через пробел: ')
        f_obj.writelines(line)
        num = line.split()
        print(num)
        print(f'Сумма введенных чисел равна: {sum(map(int, num))}')
