# Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
# Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.

def func(a, b):
    div = a / b
    return div

num1 = int(input('Введите первое число: '))
num2 = int(input('Введите второе число: '))

if num2 != 0:
    print(int(func(num1, num2)))
else:
    print('Делить на ноль нельзя! Придумайте другое число.')

