#Спортсмен занимается ежедневными пробежками.
# В первый день его результат составил a километров.
# Каждый день спортсмен увеличивал результат на 10 %
# относительно предыдущего.
# Требуется определить номер дня, на который общий результат
# спортсмена составить не менее b километров.

import random

distance = random.randint(1, 10)

max_distance = random.randint(10, 15)

i = 1

while distance < max_distance:
    print(f'День: {i} - {round(distance, 2)} км.')
    distance *= 1.1
    i += 1


print(f'На {i} день спортсмен пробежит более {max_distance} км.')
