# 2. Реализовать проект расчета суммарного расхода ткани на производство одежды.
# Основная сущность (класс) этого проекта — одежда, которая может иметь определенное название.
# К типам одежды в этом проекте относятся пальто и костюм. У этих типов одежды существуют параметры: размер (для пальто) и рост (для костюма).
# Это могут быть обычные числа: V и H, соответственно.
# Для определения расхода ткани по каждому типу одежды использовать формулы: для пальто ( ), для костюма (2 * H + 0.3).
# Проверить работу этих методов на реальных данных.
# Реализовать общий подсчет расхода ткани. Проверить на практике полученные на этом уроке знания: реализовать абстрактные
# классы для основных классов проекта, проверить на практике работу декоратора @property.

from abc import ABC, abstractmethod

class Clothes(ABC):
    @abstractmethod
    def __init__(self, h, v):
        self.h = h
        self.v = v


    @property
    def total_fab(self):
        return str(f'Общий расход ткани: {round((self.v / 6.5 + 0.5) + (2 * self.h + 0.3), 2)}')


class Coat(Clothes):

    def __init__(self, h, v):
        super().__init__(h, v)
        self.coat = self.v / 6.5 + 0.5

    def __str__(self):
        return f'Расход ткани на пальто: {round(self.coat, 2)}'


class Suit(Clothes):
    def __init__(self, h, v):
        super().__init__(h, v)
        self.suit = 2 * self.h + 0.3

    def __str__(self):
        return f'Расход ткани на костюм: {round(self.suit, 2)}'


coat1 = Coat(8, 12)
suit1 = Suit(8, 12)

print(coat1)
print(suit1)
print(coat1.total_fab)

