#  Реализовать класс Road (дорога), в котором определить атрибуты: length (длина), width (ширина).
#  Значения данных атрибутов должны передаваться при создании экземпляра класса. Атрибуты сделать защищенными.
#  Определить метод расчета массы асфальта, необходимого для покрытия всего дорожного полотна.
#  Использовать формулу: длина * ширина * масса асфальта для покрытия одного кв метра дороги асфальтом,
#  толщиной в 1 см * чи сло см толщины полотна. Проверить работу метода.


class Road:
    def __init__(self, length, width):
        self._length = length
        self._width = width

    def calc(self):
        self.weight = 25
        self.tickness = 5
        return self.length * self.width * self.weight * self.tickness / 1000


T_weight = Road(20, 5000)
T_weight.calc()
print(f'Масса асфальта, необходимого для покрытия всего дорожного полотна: {T_weight.calc()}')
