# Реализовать формирование списка, используя функцию range() и возможности генератора.
# В список должны войти четные числа от 100 до 1000 (включая границы).
# Необходимо получить результат вычисления произведения всех элементов списка

from functools import reduce


def my_func(el, even_el):
    return el * even_el

print(f'Четные числа: {[el for el in range(99, 1001) if el % 2 == 0]}')
print(f'Результат вычисления произведения всех элементов: {reduce(my_func, [el for el in range(99, 1001) if el % 2 == 0])}')