#Поработайте с переменными, создайте несколько,
# выведите на экран, запросите у пользователя несколько
# чисел и строк и сохраните в переменные, выведите на экран

greeting = ('Привет! Меня зовут Мария. \n')
age = 28
info = (f'Мне {age} лет и я учусь на python-разработчика. \n')
question = ('Теперь ваша очередь рассказать о себе.')

print(greeting + info)
print(question)

user_name = input('Как вас зовут? ')
user_age = int(input('А сколько вам лет? '))
user_occupation = input('Расскажите, кто вы по профессии? ')

print(f'Приятно познакомиться, {user_name} . \nТеперь я знаю, что вы {user_occupation} и вам {user_age} лет.')

