# Для списка реализовать обмен значений соседних элементов, т.е.
# Значениями обмениваются элементы с индексами 0 и 1, 2 и 3 и т.д.
# При нечетном количестве элементов последний сохранить на своем месте.
# Для заполнения списка элементов необходимо использовать функцию input().


i = 4
list = []

while i > 0:
    el = input('Введите элемент списка: ')
    list.append(el)
    i -= 1


first_half = list[:2]
for el in reversed(first_half):
    print(el)

second_half = list[2:4]
for el in reversed(second_half):
    print(el)

