# Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента. Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе

list = ['greeting', 2, None, 7.5, True]
print('Список:', list)

i = 0

while i < len(list):
    list_el = type(list[i])
    print (list[i], '-', list_el)
    i += 1