# Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный предмет и наличие лекционных,
# практических и лабораторных занятий по этому предмету и их количество. Важно, чтобы для каждого предмета
# не обязательно были все типы занятий. Сформировать словарь, содержащий название предмета и общее количество занятий по нему.
# Вывести словарь на экран.

subjects = {}
with open('school_subjects.txt', 'r', encoding="utf-8") as init_f:
    for line in init_f:
        import re
        subj, lect, pract, lab = re.split(': |, ', line)
        subjects[subj] = int(lect) + int(pract) + int(lab)
    print(f'Общее количество часов по предмету - \n {subjects}')



