# Реализовать функцию, принимающую несколько параметров, описывающих данные пользователя:
# имя, фамилия, год рождения, город проживания, email, телефон. Функция должна принимать параметры
# как именованные аргументы. Реализовать вывод данных о пользователе одной строкой

def user_info(**kwargs):
    return f'Имя: {kwargs["a"]}, Фамилия: {kwargs["b"]}, год рождения: {kwargs["c"]}, город: {kwargs["d"]}, email: {kwargs["e"]}, телефон: {kwargs["f"]}.'

name = input('Введите имя: ')
surn = input('Введите фамилию: ')
year = input('Введите год рождения: ')
city = input('Введите город проживания: ')
email = input('Введите e-mail: ')
phone = input('Введите номер телефона: ')


print(user_info(a=name, b=surn, c=year, d=city, e=email, f=phone))